burtlo/family-link/firmware/sdkconfig.defaults
# ESP32-S3-BOX-3 (N16R16): 16 MB flash, 16 MB octal PSRAM.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y

CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# USB Serial/JTAG console (native USB-C on the box).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Default 1 MB factory is too small once Wi-Fi + LVGL + HTTP/WS are linked.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# No wake-word / ESP-SR in these demos.
# LAN TLS demos (h16) skip server cert verify. Production must use SNTP + a CA.
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
